# IfcExportPredefinedtype Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..IfcExportPredefinedtype Property
ParameterTypeId Class See Also
---
"IFC Predefined Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId IfcExportPredefinedtype { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property IfcExportPredefinedtype As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ IfcExportPredefinedtype {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace